In [12]:
# Creating a list, iterating the schools, then printing it
high_schools = ["Hernandez High school", "Figueroa High School", "Wilson High School", "Wright High School"]
for school in high_schools:
    print(school)

Hernandez High school
Figueroa High School
Wilson High School
Wright High School

In [13]:
# Creating a dictionary, iterating and printing it
high_school_types = [{"High School": "Griffin", "Type": "District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
for hstypes in high_school_types:
    print(hstypes)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [14]:
# Importing pandas and abbreviating
import pandas as pd

In [15]:
# Creating a DataSeries using pd.Series()
school_series = pd.Series(high_schools)

In [16]:
for school in school_series:
    print(school)

Hernandez High school
Figueroa High School
Wilson High School
Wright High School

In [18]:
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [19]:
# Creating a DataFrame using .pdDataFrame() using a ^dictionary
school_df = pd.DataFrame(high_school_dicts)

In [20]:
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [21]:
# Lists to create a DataFrame with these DataSeries
school_id = [ 0, 1, 2, 3, 4]
school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]
type_of_school = ["District", "District", "Charter", "District","Charter"]

In [22]:
# First, initialize an empty DataFrame:
schools_df = pd.DataFrame()

In [23]:
# Add DataSeries to the DataFrame using list
schools_df["School ID"] = school_id

In [24]:
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [25]:
# Building on the same DataFrame
schools_df["School Name"] = school_name

In [26]:
schools_df

   School ID            School Name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [27]:
# In addition to lists, you can also use dictionaries to create a DataFrame
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [28]:
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [29]:
# To view the columns
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [30]:
# To view the values
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [31]:
# Skill Drill
school_id = [0 , 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
school_name = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School", "Griffin High School", "Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School", "Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]
school_type = ["District", "District", "Charter", "District", "Charter", "Charter", "Charter", "District", "Charter", "Charter", "Charter", "District", "District", "District", "Charter"]

In [32]:
newschools_df = pd.DataFrame()

In [33]:
newschools_df["School ID"] = school_id
newschools_df["School Name"] = school_name
newschools_df["Type"] = school_type
newschools_df

    School ID            School Name      Type
0           0      Huang High School  District
1           1   Figueroa High School  District
2           2    Shelton High School   Charter
3           3  Hernandez High School  District
4           4    Griffin High School   Charter
5           5     Wilson High School   Charter
6           6    Cabrera High School   Charter
7           7     Bailey High School  District
8           8     Holden High School   Charter
9           9       Pena High School   Charter
10         10     Wright High School   Charter
11         11  Rodriguez High School  District
12         12    Johnson High School  District
13         13       Ford High School  District
14         14     Thomas High School   Charter